<?php

namespace App\Services\Zarinpal;

class Error
{
    public function __construct(
        protected int $status
    ) {}

    /**
     * Check if the request was successful
     *
     * @return bool
     */
    public function message(): string
    {
        return match ($this->status) {
            -1 => 'اطلاعات ارسال شده ناقص است.',
            -2 => 'IP و يا مرچنت كد پذيرنده صحيح نيست',
            -3 => 'رقم تراكنش بايد بيشتر از 100 تومان باشد',
            -4 => 'سطح تاييد پذيرنده پايين تر از نقره اي است',
            -11 => 'درخواست مورد نظر يافت نشد',
            -12 => 'امكان ويرايش درخواست ميسر نمي باشد',
            -21 => 'هيچ نوع عمليات مالي براي اين تراكنش يافت نشد',
            -22 => 'تراكنش نا موفق ميباشد',
            -33 => 'رقم تراكنش با مبلغ پرداخت شده مطابقت ندارد',
            -34 => 'سقف تقسيم تراكنش از لحاظ تعداد يا رقم عبور نموده است',
            -40 => 'اجازه دسترسي به متد مربوطه وجود ندارد',
            -41 => 'اطلاعات ارسال شده مربوط به AdditionalData غيرمعتبر ميباشد',
            -42 => 'مدت زمان معتبر طول عمر پذيرنده غيرمعتبر است',
            -54 => 'درخواست مورد نظر آرشيو شده است',
            100 => 'عمليات با موفقيت انجام شد',
            101 => ' عمليات پرداخت موفق بوده و قبلا اطلاعات تراكنش ارسال شده است',
            default => 'خطای ناشناخته',
        };
    }
}
